{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "batch_input_shape": [null, 32768], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "units": 1024}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 256}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 7}}], "keras_version": "2.2.2"}